rules/nuclei/http/technologies/vmware/vmware-detect.yaml

id: vmware-detect
info:
  name: VMware Detection
  author: elouhi
  description: Sends a POST request containing a SOAP payload to a vCenter server
    to obtain version information
  severity: info
  reference:
  - https://www.pwndefend.com/2021/09/23/exposed-vmware-vcenter-servers-around-the-world-cve-2021-22005/
  - https://svn.nmap.org/nmap/scripts/vmware-version.nse
  metadata:
    max-request: 1
  tags: tech,vcenter,vmware
traps:
- request:
    method: POST
    path: /sdk/
    headers: {}
    body: |
      <?xml version="1.0" encoding="UTF-8"?>
      <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <soap:Header>
            <operationID>00000001-00000001</operationID>
         </soap:Header>
         <soap:Body>
            <RetrieveServiceContent xmlns="urn:internalvim25">
               <_this xsi:type="ManagedObjectReference" type="ServiceInstance">ServiceInstance</_this>
            </RetrieveServiceContent>
         </soap:Body>
      </soap:Envelope>
  response:
    status_code: 200
    headers:
      VulTrap: text/xml
    body: ha-folder-rootRetrieveServiceContentResponse
